[
  {
    "id": "roadrunner",
    "name": "Roadrunner",
    "image": "assets/roadrunner.png",
    "keywords": [
      "messenger",
      "timing",
      "movement-between-worlds",
      "protection"
    ],
    "mantra": "I move unseen; my timing is true.",
    "movement": "Light zig-zag steps, crossing feet to trace an X—become untrackable.",
    "meaning": "The Roadrunner carries messages across thresholds. It asks you to act with quick clarity and to keep your path untrackable to energies that do not serve you. Watch for signs; move when the moment opens.",
    "reversed": "Haste, scattered focus, or broadcasting your path too loudly. Slow down; choose one clear action."
  },
  {
    "id": "snake",
    "name": "Snake",
    "image": "assets/snake.png",
    "keywords": [
      "transformation",
      "shed-skin",
      "shadow-alchemy",
      "infinity"
    ],
    "mantra": "I am the life beneath the skin.",
    "movement": "Lie close to the ground, breathe deep, rise with a slow undulating spine—feel the new skin.",
    "meaning": "Snake is sacred transformation: shedding what is finished while keeping your essence. Venom is medicine in right dose—integrate shadow into healing.",
    "reversed": "Avoidance of change, clinging to the old skin, fear of your own power. Begin a small shedding."
  },
  {
    "id": "owl",
    "name": "Owl",
    "image": "assets/owl.png",
    "keywords": [
      "night-vision",
      "truth-seeing",
      "stillness",
      "guidance"
    ],
    "mantra": "In stillness, I see clearly.",
    "movement": "Stand tall, soften gaze, turn head slowly side to side, then close eyes and listen.",
    "meaning": "Owl brings luminous sight in the dark. Pause; listen beneath the noise. Guidance is present when you choose quiet vision over reaction.",
    "reversed": "Illusion, projection, or fear-led guesses. Return to stillness before moving."
  },
  {
    "id": "jaguar",
    "name": "Jaguar",
    "image": "assets/jaguar.png",
    "keywords": [
      "threshold-guardian",
      "precision",
      "silent-power"
    ],
    "mantra": "My power is quiet and precise.",
    "movement": "Low, strong steps; shoulders relaxed; eyes soft but focused—move only when it is time.",
    "meaning": "Jaguar guards the edge between worlds. Conserve your force, wait in the shadows, then act cleanly and once.",
    "reversed": "Posturing, scattered force, or striking without aim. Return to stillness to regain accuracy."
  },
  {
    "id": "foxpair",
    "name": "Fox Pair",
    "image": "assets/foxpair.png",
    "keywords": [
      "partnership",
      "adaptability",
      "cleverness"
    ],
    "mantra": "We move as one—light, alert, and kind.",
    "movement": "Side-step lightly, mirror your partner’s motion; practice silent sync for three breaths.",
    "meaning": "The Fox Pair teaches relational agility. Blend play with strategy; listen with your whole body; adapt together.",
    "reversed": "Misdirection or mixed signals. Speak plainly; reset the rhythm before moving."
  },
  {
    "id": "killdeer",
    "name": "Killdeer",
    "image": "assets/killdeer.png",
    "keywords": [
      "warning",
      "boundary",
      "decoy-medicine"
    ],
    "mantra": "I protect by redirecting.",
    "movement": "Step forward with a clear ‘no,’ then angle away—practicing a clean redirection.",
    "meaning": "Killdeer feigns a broken wing to draw danger from the nest. Protect what’s tender by skillfully redirecting attention.",
    "reversed": "People-pleasing or porous boundaries. Say the true no; defend the vulnerable directly."
  },
  {
    "id": "crow",
    "name": "Crow",
    "image": "assets/crow.png",
    "keywords": [
      "memory",
      "ancestry",
      "storykeeper",
      "intelligence"
    ],
    "mantra": "The stories remember me; I remember them.",
    "movement": "Hands to temples, then open palms outward as if releasing a story to the sky.",
    "meaning": "Crow keeps the shared memory between worlds. What you do echoes. Tell the true story; let the rest fly.",
    "reversed": "Old narratives looping. Break the spell by naming the present moment clearly."
  }
]